OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  config_save_admin(quser, qpass);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void
handleSetTime(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool qsntp_enable = isPositive(request, "ntp");
  String qtz = request->getParam("tz");

  config_save_sntp(qsntp_enable, qtz);
  if(config_sntp_enabled()) {
    time_check_now();
  }

  if(false == qsntp_enable)
  {
    String time = request->getParam("time");

    struct tm tm;

    int yr, mnth, d, h, m, s;
    if(6 == sscanf( time.c_str(), "%4d-%2d-%2dT%2d:%2d:%2dZ", &yr, &mnth, &d, &h, &m, &s))
    {
      tm.tm_year = yr - 1900;
      tm.tm_mon = mnth - 1;
      tm.tm_mday = d;
      tm.tm_hour = h;
      tm.tm_min = m;
      tm.tm_sec = s;

      struct timeval set_time = {0,0};
      set_time.tv_sec = mktime(&tm);

      time_set_time(set_time, "manual");

    }
    else
    {
      response->setCode(400);
      response->print("could not parse time");
      request->send(response);
      return;
    }
  }

  response->setCode(200);
  response->print("set");
  request->send(response);
}

// -------------------------------------------------------------------
// Save advanced settings
// url: /saveadvanced
// -------------------------------------------------------------------
void
handleSaveAdvanced(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String qhostname = request->getParam("hostname");
  String qsntp_host = request->getParam("sntp_host");

  config_save_advanced(qhostname, qsntp_host);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /tesla/vehicles
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  StaticJsonDocument<1024> doc;
  int count = teslaClient.getVehicleCnt();
  doc["count"] = count;
  JsonArray vehicles = doc.createNestedArray("vehicles");

  for (int i = 0; i < count; i++)
  {
    JsonObject vehicle = vehicles.createNestedObject();
    vehicle["id"] = teslaClient.getVehicleId(i);
    vehicle["name"] = teslaClient.getVehicleDisplayName(i);
  }

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}


// -------------------------------------------------------------------
// Proxy Tesla authentication requests
// url: /tesla/auth
// -------------------------------------------------------------------
void
handleTeslaAuth(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String url = "https://auth.tesla.com/oauth2/v3/authorize?";
  url += request->queryString().toString();
  DBUGVAR(url);
  MongooseHttpClientRequest *teslaRequest = teslaProxy.beginRequest(url.c_str());
  teslaRequest->setMethod(HTTP_GET);
  teslaRequest->addHeader("sec-fetch-site", "none");
  teslaRequest->addHeader("sec-fetch-mode", "navigate");
  teslaRequest->addHeader("sec-fetch-user", "?1");
  teslaRequest->addHeader("sec-fetch-dest", "document");
  teslaRequest->onResponse([request, response](MongooseHttpClientResponse *teslaResponse) 
  {
    DBUGF("Got response: \n%.*s", teslaResponse->message().length(), teslaResponse->message().c_str());
    response->setCode(teslaResponse->respCode());

    StaticJsonDocument<1024> doc;
    if(200 == teslaResponse->respCode())
    {
      MongooseString body = teslaResponse->body();
    } else {
      doc["msg"] = "Error fetching from Tesla API";
    }

    serializeJson(doc, *response);
    request->send(response);
  });

  teslaProxy.send(teslaRequest);
}


// -------------------------------------------------------------------
// Save the Ohm keyto EEPROM
// url: /handleSaveOhmkey
// -------------------------------------------------------------------
void
handleSaveOhmkey(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool enabled = isPositive(request->getParam("enable"));
  String qohm = request->getParam("ohm");

  config_save_ohm(enabled, qohm);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void
handleStatus(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  const size_t capacity = JSON_OBJECT_SIZE(40) + 1024;
  DynamicJsonDocument doc(capacity);

  if (net_eth_connected()) {
    doc["mode"] = "Wired";
  } else if (net_wifi_mode_is_sta_only()) {
    doc["mode"] = "STA";
  } else if (net_wifi_mode_is_ap_only()) {
    doc["mode"] = "AP";
  } else if (net_wifi_mode_is_ap() && net_wifi_mode_is_sta()) {
    doc["mode"] = "STA+AP";
  }

  doc["wifi_client_connected"] = (int)net_wifi_client_connected();
  doc["eth_connected"] = (int)net_eth_connected();
  doc["net_connected"] = (int)net_is_connected();
  doc["ipaddress"] = ipaddress;

