OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  scheduler.serializePlan(doc);
  response->setCode(200);
  serializeJson(doc, *response);

  request->send(response);
}

void handleOverrideGet(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.isActive())
  {
    EvseProperties props;
    manual.getProperties(props);
    props.serialize(response);
  } else {
    response->setCode(404);
    response->print("{\"msg\":\"No manual override\"}");
  }
}

void handleOverridePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();

  EvseProperties props;
  if(props.deserialize(body))
  {
    if(manual.claim(props)) {
      response->setCode(201);
      response->print("{\"msg\":\"Created\"}");
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"Failed to claim manual overide\"}");
    }
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to parse JSON\"}");
  }
}

void handleOverrideDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.release()) {
    response->setCode(200);
    response->print("{\"msg\":\"Deleted\"}");
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to release manual overide\"}");
  }
}

void handleOverridePatch(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.toggle())
  {
    response->setCode(200);
    response->print("{\"msg\":\"Updated\"}");
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to toggle manual overide\"}");
  }
}

void
handleOverride(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {
    handleOverrideGet(request, response);
  } else if(HTTP_POST == request->method()) {
    handleOverridePost(request, response);
  } else if(HTTP_DELETE == request->method()) {
    handleOverrideDelete(request, response);
  } else if(HTTP_PATCH == request->method()) {
    handleOverridePatch(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

// -------------------------------------------------------------------
// Reset config and reboot
// url: /reset
// -------------------------------------------------------------------
void
handleRst(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  config_reset();
  ESPAL.eraseConfig();

  response->setCode(200);
  response->print("1");
  request->send(response);

  systemRebootTime = millis() + 1000;
}


// -------------------------------------------------------------------
// Restart (Reboot)
// url: /restart
// -------------------------------------------------------------------
void
handleRestart(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  response->setCode(200);
  response->print("1");
  request->send(response);

  systemRebootTime = millis() + 1000;
}


// -------------------------------------------------------------------
// Emoncms describe end point,
// Allows local device discover using https://github.com/emoncms/find
// url: //emoncms/describe
// -------------------------------------------------------------------
void handleDescribe(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseBasic *response = request->beginResponse();
  response->setCode(200);
  response->setContentType(CONTENT_TYPE_TEXT);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->setContent("openevse");
  request->send(response);
}

// -------------------------------------------------------------------
// Update firmware
// url: /update
// -------------------------------------------------------------------
void
handleUpdateGet(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_HTML)) {
    return;
  }

  response->setCode(200);
  response->print(
    F("<html><form method='POST' action='/update' enctype='multipart/form-data'>"
        "<input type='file' name='firmware'> "
        "<input type='submit' value='Update'>"
      "</form></html>"));
  request->send(response);
}

static MongooseHttpServerResponseStream *upgradeResponse = NULL;

void
handleUpdatePost(MongooseHttpServerRequest *request) {
  if(NULL != upgradeResponse) {
    request->send(500, CONTENT_TYPE_TEXT, "Error: Upgrade in progress");
    return;
  }

  if(false == requestPreProcess(request, upgradeResponse, CONTENT_TYPE_TEXT)) {
    return;
  }

  // TODO: Add support for returning 100: Continue
}

static int lastPercent = -1;

static void handleUpdateError(MongooseHttpServerRequest *request)
{
  upgradeResponse->setCode(500);
  upgradeResponse->printf("Error: %d", Update.getError());
  request->send(upgradeResponse);
  upgradeResponse = NULL;

  // Anoyingly this uses Stream rather than Print...
#ifdef ENABLE_DEBUG
  Update.printError(DEBUG_PORT);
#endif
}

size_t
handleUpdateUpload(MongooseHttpServerRequest *request, int ev, MongooseString filename, uint64_t index, uint8_t *data, size_t len)
{
  if(MG_EV_HTTP_PART_BEGIN == ev)
  {
//    dumpRequest(request);

    DEBUG_PORT.printf("Update Start: %s\n", filename.c_str());

    lcd.display(F("Updating WiFi"), 0, 0, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
    lcd.display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);

    if(!Update.begin()) {
      handleUpdateError(request);
    }
  }

  if(!Update.hasError())
  {
    //DBUGF("Update Writing %llu", index);

    size_t contentLength = request->contentLength();
    DBUGVAR(contentLength);
    if(contentLength > 0)
    {
      int percent = index / (contentLength / 100);
      DBUGVAR(percent);
      DBUGVAR(lastPercent);
      if(percent != lastPercent) {
        String text = String(percent) + F("%");
        lcd.display(text, 0, 1, 10 * 1000, LCD_DISPLAY_NOW);
        DEBUG_PORT.printf("Update: %d%%\n", percent);
        lastPercent = percent;
      }
    }
    if(Update.write(data, len) != len) {
      handleUpdateError(request);
    }
  }

  if(MG_EV_HTTP_PART_END == ev)
  {
    DBUGLN("Upload finished");
    if(Update.end(true)) {
      DBUGF("Update Success: %lluB", index+len);
      lcd.display(F("Complete"), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
      upgradeResponse->setCode(200);
      upgradeResponse->print("OK");
      request->send(upgradeResponse);
      upgradeResponse = NULL;
    } else {
      DBUGF("Update failed: %d", Update.getError());
      lcd.display(F("Error"), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
      handleUpdateError(request);
    }
  }

  return len;
}

